server/app/service/service_seller_update.rb

SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = $1 LIMIT $2  [["id", "3"], ["LIMIT", 1]]
UPDATE "sellers" SET "name" = $1, "email" = $2, "phone" = $3, "address" = $4, "updated" = $5 WHERE "sellers"."id" = $6  [["name", "seller name 3"], ["email", "email seller 3"], ["phone", "333-333"], ["address", "calle 333"], ["updated", "2023-08-25 11:56:27.377422"], ["id", "3"]]
---
    def execute(params)
        begin
            obj = Seller.find(params[:id])
            return get_json_error_msg('Not found object by id.') if obj.nil?
            params[:created] = obj.created
            params[:updated] = Time.now
            upd = obj.update(params)