server/app/service/service_seller_find.rb

    def execute(id)
        begin
            return Seller.find(id)
---
SELECT "sellers".* FROM "sellers" WHERE "sellers"."id" = $1 LIMIT $2  [["id", "1"], ["LIMIT", 1]]