server/app/service/service_sale_list.rb

SELECT "sales".* FROM "sales" ORDER BY updated DESC
---
    def execute()
        sales = Sale.order('updated DESC');