server/app/service/service_sale_update.rb

    def execute(params)
        begin
            sale = Sale.find(params[:id])
            return get_json_error_msg('Not found object by id.') if sale.nil?

            ret = false
            Sale.transaction do
                Productsale.where(:sale_id => params["id"]).delete_all
                new_sale = {:id => params["id"], :client_id => params["client_id"], :seller_id => params["seller_id"], :created => sale.created, :updated => Time.now}
                sale.productsales = getListProductSales(params[:id], params["productsales"])
                ret = sale.update(new_sale)
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "productsales".* FROM "productsales" WHERE "productsales"."sale_id" = $1  [["sale_id", 14]]
DELETE FROM "productsales" WHERE "productsales"."sale_id" = $1  [["sale_id", 14]]
INSERT INTO "productsales" ("sale_id", "product_id", "product_name", "price", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sale_id", 14], ["product_id", "1"], ["product_name", "product one"], ["price", "123.0"], ["quantity", 1]]
UPDATE "sales" SET "updated" = $1 WHERE "sales"."id" = $2  [["updated", "2023-08-25 12:03:55.222321"], ["id", 14]]

    def getListProductSales(id, list)
        arrProductSales = []
        list.each do |item|
            prd = Product.find(item["product_id"])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "1"], ["LIMIT", 1]]