server/app/service/service_client_create.rb

    def execute(params)
        begin
            obj = Client.new(params)
            return obj.save! ? get_json_success(obj) : get_json_error(obj)
---
INSERT INTO "clients" ("id", "name", "email", "phone", "address") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", "3"], ["name", "client 3"], ["email", "email 3"], ["phone", "345"], ["address", "rua 333"]]