server/app/service/service_product_find.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "1"], ["LIMIT", 1]]
---
    def execute(id)
        begin
            return Product.find(id)