server/app/service/service_product_create.rb

INSERT INTO "products" ("id", "name", "price") VALUES ($1, $2, $3) RETURNING "id"  [["id", "3"], ["name", "product three"], ["price", "333.0"]]
---
    def execute(params)
        begin
            obj = Product.new(params)
            return obj.save! ? get_json_success(obj) : get_json_error(obj)