server/app/service/service_product_update.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "3"], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "updated" = $3 WHERE "products"."id" = $4  [["name", "seller three x"], ["price", "444.0"], ["updated", "2023-08-25 11:55:44.849291"], ["id", "3"]]
---
    def execute(params)
        begin
            obj = Product.find(params[:id])
            return get_json_error_msg('Not found object by id.') if obj.nil?
            params[:created] = obj.created
            params[:updated] = Time.now
            upd = obj.update(params)