server/app/service/service_sale_create.rb

INSERT INTO "sales" ("client_id", "seller_id") VALUES ($1, $2) RETURNING "id"  [["client_id", "1"], ["seller_id", "1"]]
INSERT INTO "productsales" ("sale_id", "product_id", "product_name", "price", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sale_id", 14], ["product_id", "1"], ["product_name", "product one"], ["price", "123.0"], ["quantity", 1]]
---
    def execute(params)
        begin
            ret = false
            params_n = {:client_id => params["client_id"], :seller_id => params["seller_id"]}
            sale = Sale.new(params_n)
            Sale.transaction do
                ret = sale.save!
                if ret
                    sale.productsales = getListProductSales(sale[:id], params["productsales"])
                    ret = sale.save!

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "1"], ["LIMIT", 1]]
---
    def getListProductSales(id, list)
        arrProductSales = []
        list.each do |item|
            prd = Product.find(item["product_id"])