server/app/service/service_client_update.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", "3"], ["LIMIT", 1]]
UPDATE "clients" SET "name" = $1, "email" = $2, "phone" = $3, "updated" = $4 WHERE "clients"."id" = $5  [["name", "client three"], ["email", "email three"], ["phone", "333"], ["updated", "2023-08-25 12:02:15.917815"], ["id", "3"]]
---
    def execute(params)
        begin
            obj = Client.find(params[:id])
            return get_json_error_msg('Not found object by id.') if obj.nil?
            params[:created] = obj.created
            params[:updated] = Time.now
            upd = obj.update(params)