server/app/service/service_client_find.rb

    def execute(id)
        begin
            return Client.find(id)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", "1"], ["LIMIT", 1]]