server/app/service/service_sale.rb

    def list()
        sales = Sale.order('updated DESC');
---
SELECT "sales".* FROM "sales" ORDER BY updated DESC

    def insert(params)
        begin
            ret = false
            params_n = {:client_id => params["client_id"], :seller_id => params["seller_id"]}
            sale = Sale.new(params_n)
            Sale.transaction do
                ret = sale.save!
                if ret
                    sale.productsales = getListProductSales(sale[:id], params["productsales"])
                    ret = sale.save!
---
INSERT INTO "sales" ("client_id", "seller_id") VALUES ($1, $2) RETURNING "id"  [["client_id", "1"], ["seller_id", "1"]]
INSERT INTO "productsales" ("sale_id", "product_id", "product_name", "price", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sale_id", 12], ["product_id", "1"], ["product_name", "product one"], ["price", "123.0"], ["quantity", 1]]

    def getListProductSales(id, list)
        arrProductSales = []
        list.each do |item|
            prd = Product.find(item["product_id"])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "1"], ["LIMIT", 1]]

    def update(params)
        begin
            sale = Sale.find(params[:id])
            return get_json_error_msg('Not found object by id.') if sale.nil?

            ret = false
            Sale.transaction do
                Productsale.where(:sale_id => params["id"]).delete_all
                new_sale = {:id => params["id"], :client_id => params["client_id"], :seller_id => params["seller_id"], :created => sale.created, :updated => Time.now}
                sale.productsales = getListProductSales(params[:id], params["productsales"])
                ret = sale.update(new_sale)
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "productsales".* FROM "productsales" WHERE "productsales"."sale_id" = $1  [["sale_id", 10]]
DELETE FROM "productsales" WHERE "productsales"."sale_id" = $1  [["sale_id", 11]]
INSERT INTO "productsales" ("sale_id", "product_id", "product_name", "price", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sale_id", 10], ["product_id", "2"], ["product_name", "product two"], ["price", "222.0"], ["quantity", 2]]
UPDATE "sales" SET "client_id" = $1, "seller_id" = $2, "updated" = $3 WHERE "sales"."id" = $4  [["client_id", "2"], ["seller_id", "2"], ["updated", "2023-08-24 19:33:35.117636"], ["id", 10]]