server/app/service/service_sale_find.rb

    def execute(id)
        begin
            sale = Sale.find(id)
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]