server/app/service/service_seller_create.rb

INSERT INTO "sellers" ("id", "name", "email", "phone", "address") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", "3"], ["name", "seller three"], ["email", "email three"], ["phone", "334455"], ["address", "rua 3333"]]
---
    def execute(params)
        begin
            obj = Seller.new(params)
            return obj.save! ? get_json_success(obj) : get_json_error(obj)