server/app/controllers/client_controller.rb

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
    def show
        render json: {status: 'SUCCESS', message:'Loaded client', data:ServiceClient.new.find(params[:id])},status: :ok

INSERT INTO `clients` (`number`, `name`, `email`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('00790786567', 'Darlane Castro', 'darlanecsc@gmail.com', '31-99985-1657', 'Rua das Industrias, 1177, apto 203', '2021-11-01 18:23:59.527811', '2021-11-01 18:23:59.527811')
---
    def create
        params_hash = {:id => params["id"], :name => params["name"], :email => params["email"], :phone => params["phone"], :address => params["address"]}
        resp = ServiceClient.new.insert(params_hash)