server/app/controllers/product_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    def show
        render json: {status: 'SUCCESS', message:'Loaded product', data:ServiceProduct.new.find(params[:id])},status: :ok

INSERT INTO `products` (`name`, `description`, `value`, `created_at`, `updated_at`) VALUES ('name produto 1', 'desc produto 1', 17.0, '2021-11-01 18:31:20.211725', '2021-11-01 18:31:20.211725')
---
    def create
        params_hash = {:id => params["id"], :name => params["name"], :price => params["price"]}
        resp = ServiceProduct.new.insert(params_hash)