server/app/controllers/sale_controller.rb

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
---
    def show
        render json: {status: 'SUCCESS', message:'Loaded sale', data:ServiceSale.new.find(params[:id])},status: :ok

INSERT INTO `sales` (`client_id`, `seller_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-11-01 18:58:25.647712', '2021-11-01 18:58:25.647712')
---
    def create
        resp = ServiceSale.new.insert(params)