server/app/controllers/seller_controller.rb

SELECT `sellers`.* FROM `sellers` WHERE `sellers`.`id` = 1 LIMIT 1
---
    def show
        render json: {status: 'SUCCESS', message:'Loaded seller', data:ServiceSeller.new.find(params[:id])},status: :ok

INSERT INTO `sellers` (`number`, `name`, `email`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('1', 'Rodrigo Castro', 'rodrigo@gmail.com', '31-99368-1841', 'Rua das Industrias, 1177, apto 203', '2021-11-01 18:28:28.491712', '2021-11-01 18:28:28.491712')
---
    def create
        params_hash = {:id => params["id"], :name => params["name"], :email => params["email"], :phone => params["phone"], :address => params["address"]}
        resp = ServiceSeller.new.insert(params_hash)